<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | Trace设置 开启 app_trace 后 有效
// +----------------------------------------------------------------------
return [
    // 内置Html Console 支持扩展
    'type' => 'console', // 使用浏览器console输出trace信息'type'  =>  'console',默认'type' => 'Html'
    'trace_tabs' =>  [
        'base'=>'基本',
        'file'=>'文件',
        'error|notice|warning'=>'错误',
        'sql'=>'SQL',
        'user'=>'用户'
    ]
];
